
import styles from './RemBody.module.css'

function RemBody() {

    return (
        <>

            <div className={styles.Main}>
                <div className={styles.Inner}>
                    <div className={styles.Title}>
                        <p>Ремонт квартиры под ключ</p>
                    </div>
                    <div className={styles.Quest}>
                        <div className={styles.Left}>
                            <ul>
                                <li>Работаем только по договору.</li>
                                <li>Все работы выполняются под руководством опытного <br /> прораба, более чем с 20-летним стажем отделочных работ.</li>
                                <li>Перед началом ремонта создадим дизайн-проект под <br /> ваш запрос.</li>
                                <li>Смета может измениться только по инициативе заказчика.</li>
                                <li>Минимальное участие заказчика в процессе.</li>
                            </ul>
                            <div className={styles.BtnQuest}>
                                <p>Оставить заявку</p>
                                <button className={styles.KnopCall}>Заказать обратный звонок</button>
                            </div>
                        </div>
                        <div className={styles.Right}>
                            <img className={styles.RightI} src="public/Image/rightimg.png" alt="" />
                        </div>
                    </div>
                    <div className={styles.Desc}>
                        <div className={styles.FLine}>
                            <p>Ремонт квартиры под ключ — это, в первую очередь, делегирование всех текущих забот по благоустройству вашего помещения профессионалам.<br />Заказывая эту услугу, вы освобождаете себя от массы проблем:</p>
                        </div>
                        <div className={styles.Perec}>
                            <ul>
                                <li>Вам не нужно думать, что сделать вперед: заменить электрику, разобраться с сантехникой или вообще залить пол? </li>
                                <li>Вы не узнаете о такой неприятной черте мастеров-одиночек, как: безответственность, срывание сроков, отсутствие гарантий и прочее.</li>
                                <li>Вы и ваша семья не будут жить в недоделанных квартире или доме и спать на надувном матрасе и дышать при этом строительной пылью. </li>
                                <li>Вы сможете избежать ненужных внутренних конфликтов с близкими людьми, которые всегда возникают в период стресса и портят атмосфер.</li>
                                <li>В итоге по окончанию ремонта вы сэкономите приличную сумму денег и, что гораздо важнее, сохраните свои нервные клетки. </li>
                            </ul>
                        </div>
                        <div className={styles.BlockOne}>
                            <p>Ремонт должен быть приятным этапом воплощения вашей идеи для создания идеальной квартиры, а не дорогим способом <br />подорвать собственное здоровье и разрушить отношения с близкими</p>
                        </div>
                        <div className={styles.Desc}>
                            <p> Услуга комплексного ремонта только на первый взгляд кажется дорогой. Но на самом деле это наиболее выгодный вариант. <span>Во-первых</span>, всематериалы закупаются по оптовым ценам, ввиду объемов работы. <span>Во-вторых</span> , все мелкие работы также выполняются бригадой и это не стоит бешеных денег за счет проектной оплаты. <br /><span>В-третьих</span>, ответственность сторон четко определена и поэтому исключается ситуация что вам придется доплачивать за устранение недочетов. Вторым,равноценным преимуществом этой услуги, является скорость. Ремонт под ключ — это вопрос нескольких месяцев, когда так «отрывочные» работы могут затянуться на долгие годы, что негативно скажется на вашем комфорте.</p>
                        </div>
                    </div>
                    <div className={styles.Sell}>
                        <div className={styles.TitleSell}>
                            <p>Стоимость работ</p>
                        </div>
                        <div className={styles.DescSell}>
                            <p>Стоимость работ рассчитывается индивидуально. На неё влияет множество факторов, такие как: сложность объекта, материалы, сложность<br />реализации идеи, количество задействованных мастеров, сроки, финансирование, наличие дизайн-проекта и так далее. Для ориентировочной<br />оценки отталкивайтесь от 8 000 руб./м2.</p>
                        </div>
                        <div className={styles.BlockTwo}>
                            <p>Стоимость работ — от 8 000 руб./м2</p>
                        </div>
                        <div className={styles.OpisSell}>
                            <p>Перед началом работ обязательно составляется смета, которая согласовывается с заказчиком. Она может измениться в процессе, но только по<br />вашей инициативе. По опыту, это как правило 10-15% как в меньшую, так и в большую сторону.</p>
                            <p>Работаем по предоплате. Дальнейший расчет производится по закрытым актам приема-передачи выполненных работы. Чем меньше предоплата, тем сильнее <br />раздроблены этапы оплаты, — тем чаще нам придется встречаться. Выполненные работы по смете не превышают стоимость внесенной предоплаты.</p>
                            <p>Бесплатно выезжаем на замер в черте города. За городом услуга оплачивается в зависимости от удаленности. Сумму за замер называем сразу<br />при разговоре по телефону. </p>
                            <p>При наличии недочетов заказчик не подписывает акт, соответственно не происходит расчет работника до полного устранения замечаний. Если недочеты были <br />обнаружены после завершения работ, клиента защищает гарантия по договору и гарантия от производителя на материал. В любом случае недочеты будут <br />устранены.</p>
                        </div>
                    </div>
                    <div className={styles.Primers}>
                        <div className={styles.TitleP}>
                            <p>Примеры наших работ</p>
                        </div>
                        <div className={styles.Photos}>
                            <div className={styles.Photo}><img src="/public/Image/prim1.png" alt="" /></div>
                            <div className={styles.Photo}><img src="/public/Image/prim2.png" alt="" /></div>
                            <div className={styles.Photo}><img src="/public/Image/prim3.png" alt="" /></div>
                            <br />
                            <div className={styles.Photo}><img src="/public/Image/prim4.png" alt="" /></div>
                            <div className={styles.Photo}><img src="/public/Image/prim5.png" alt="" /></div>
                            <div className={styles.Photo}><img src="/public/Image/prim6.png" alt="" /></div>
                            <br />
                            <div className={styles.Photo}><img src="/public/Image/prim7.png" alt="" /></div>
                            <div className={styles.Photo}><img src="/public/Image/prim8.png" alt="" /></div>
                            <div className={styles.Photo}><img src="/public/Image/prim9.png" alt="" /></div>
                        </div>
                    </div>
                </div>
            </div>
        </>
    )
}

export default RemBody
